//=====================================================================
//
// script_loader [script_loader.cpp]
// Author : 
// 
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "script_loader.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_READABLE_CHAR	(256)

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void _Read_SCRIPT(FILE* pFile);


//=====================================================================
// スクリプト読み込み処理
//=====================================================================
void LoadScript(const char* pFileName)
{
	FILE* pFile = fopen(pFileName, "r");

	if (pFile != NULL)
	{
		char aStrLine[MAX_READABLE_CHAR] = {};

		while (true)
		{
			if (fscanf(pFile, "%s", &aStrLine[0]) == EOF)
			{
				break;
			}

			if (strcmp(&aStrLine[0], "SCRIPT") == 0)
			{
				OutputDebugString("[script_loader.cpp] Script Start\n");
				_Read_SCRIPT(pFile);
			}
			
		}

		OutputDebugString("[script_loader.cpp] Script End\n");
		
	}
	else
	{
		OutputDebugString("[script_loader.cpp] Script Failed\n");
	}
}

void _Read_SCRIPT(FILE* pFile)
{
	char aStrLine[MAX_READABLE_CHAR] = {};

	int num = 0;

	while (true)
	{
		if (fscanf(pFile, "%s", &aStrLine[0]) == EOF)
		{
			break;
		}

		if (strcmp(&aStrLine[0], "NUM_MODEL") == 0)
		{
			fscanf(pFile, " = %d", &num);
		}
		else if (strcmp(&aStrLine[0], "MODEL_FILENAME") == 0)
		{

		}
	}


}